app/controllers/comments_controller.rb

  def create
    @parent = Post.find_by_id(params[:post_id]) if params[:post_id]
    @parent = Comment.find_by_id(params[:comment_id]) if params[:comment_id]

    @comment  =  @parent.comments.new( body:  comment_params[:body])
    @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Olaaa. Is anybody here?"], ["commentable_type", "Post"], ["commentable_id", 1], ["created_at", 2016-11-03 18:36:05 UTC], ["updated_at", 2016-11-03 18:36:05 UTC]]