app/controllers/posts_controller.rb

  def index
    @posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    post = Post.new(post_params)
    post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "Hi!!! It`s my second post. And my microblog is grow!!!"], ["created_at", 2016-11-03 15:31:48 UTC], ["updated_at", 2016-11-03 15:31:48 UTC]]